src/soap/AddTreatyAmount-2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:AddTreatyAmount>
         <tem:treatyAmount>
            <tem:TreatyId>
               <tem:Value>{{payload.TreatyId}}</tem:Value>
            </tem:TreatyId>
            <tem:AmountId>
               <tem:Value>{{payload.AmountId}}</tem:Value>
            </tem:AmountId>
            <tem:Kind>
               <tem:Value>{{payload.Kind}}</tem:Value>
            </tem:Kind>            
            <tem:DayDate>
               <tem:Year>{{payload.DayDate.Year}}</tem:Year>
               <tem:Month>{{payload.DayDate.Month}}</tem:Month>
               <tem:Day>{{payload.DayDate.Day}}</tem:Day>
            </tem:DayDate>  
         </tem:treatyAmount>
      </tem:AddTreatyAmount>
   </soapenv:Body>
</soapenv:Envelope>